; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image2 - mode
	image0 - mode
	infrared1 - mode
	infrared3 - mode
	GroundStation2 - direction
	Star6 - direction
	Star7 - direction
	GroundStation9 - direction
	GroundStation8 - direction
	Star4 - direction
	Star3 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon16)
	(supports instrument1 image0)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
)
(:goal (and
	(have_image Star10 infrared3)
	(have_image Star11 infrared1)
	(have_image Star13 infrared1)
	(have_image Star14 image0)
	(have_image Star15 image2)
	(have_image Phenomenon16 image2)
))

)

; plan
1. (turn_to satellite1 star4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite1 star14 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star14)
   goals met: 0 of 6
5. (turn_to satellite0 groundstation1 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 6
6. (take_image satellite1 star14 instrument1 image0)
   added: (have_image star14 image0)
   goals met: 1 of 6
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
8. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 1 of 6
9. (turn_to satellite0 phenomenon16 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 6
10. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 6
11. (turn_to satellite0 star10 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
12. (take_image satellite0 star10 instrument0 infrared3)
   added: (have_image star10 infrared3)
   goals met: 3 of 6
13. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 6
14. (take_image satellite0 star11 instrument0 infrared1)
   added: (have_image star11 infrared1)
   goals met: 4 of 6
15. (turn_to satellite0 star13 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star13)
   goals met: 4 of 6
16. (take_image satellite0 star13 instrument0 infrared1)
   added: (have_image star13 infrared1)
   goals met: 5 of 6
17. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 5 of 6
18. (take_image satellite0 star15 instrument0 image2)
   added: (have_image star15 image2)
   goals met: 6 of 6
